[
  {
    "name": "Воин",
    "value": "Fighter",
    "description": "Мастерски владеют оружием, доспехами, и приёмами ведения боя. А еще они хорошо знакомы со смертью — они несут её сами, и часто смотрят в её холодные глаза.",
    "advice": "Во-первых, у вашей Силы или Ловкости должно быть наивысшее значение (в зависимости от того, хотите ли вы сосредоточиться на рукопашном оружии или на стрельбе из лука). Следующим по величине должно быть значение Телосложения или Интеллекта.",
    "proficiency": "на 1 уровне +2, с 5 уровня +3"
  },
  {
    "name": "Волшебник",
    "value": "Wizard",
    "description": "Опираясь на тонкие плетения магии, пронизывающей вселенную, волшебники способны создавать заклинания взрывного огня, искрящихся молний, тонкого обмана и грубого контроля над сознанием.",
    "advice": "Во-первых, у вашего Интеллекта должно быть наивысшее значение. Следующим по величине должно быть значение Телосложения или Ловкости.",
    "proficiency": "на 1 уровне +2, с 5 уровня +3"
  },
  {
    "name": "Плут",
    "value": "Rogue",
    "description": " У них достаточно сноровки для нахождения решения в любой ситуации, демонстрируя находчивость и гибкость, которые являются краеугольным камнем любой успешной группы искателей приключений.",
    "advice": "Во-первых, у вашей Ловкости должно быть наивысшее значение. Следующим по величине должно быть значение Интеллекта, при условии, что вы планируете взять архетип Мистический ловкач. В противном случае выберите Харизму, если планируете пользоваться обманом и социальным взаимодействием.",
    "proficiency": "на 1 уровне +2, с 5 уровня +3"
  },
  {
    "name": "Жрец",
    "value": "Cleric",
    "description": "Жрецы являются посредниками между миром смертных и далёкими мирами богов. Настолько же разные, насколько боги, которым они служат, жрецы воплощают работу своих божеств. В отличие от обычного проповедника, жрец наделён божественной магией.",
    "advice": "Во-первых, у вашей Мудрости должно быть наивысшее значение. Следующей по величине характеристикой должна быть Сила или Телосложение.",
    "proficiency": "на 1 уровне +2, с 5 уровня +3"
  },
  {
    "name": "Следопыт",
    "value": "Ranger",
    "description": "Вдали от суеты городов и посёлков, за изгородями, которые защищают самые далёкие фермы от ужасов дикой природы, среди плотно стоящих деревьев, беспутья лесов и на просторах необъятных равнин следопыты несут свой бесконечный дозор.",
    "advice": "Во-первых, у вашей Ловкости должно быть наивысшее значение. Следующим по величине должно быть значение Мудрости. Следопыты, концентрирующиеся на сражении с двумя оружиями, делают наивысшей характеристикой Силу, а не Ловкость.",
    "proficiency": "на 1 уровне +2, с 5 уровня +3"
  },
  {
    "name": "Варвар",
    "value": "Barbarian",
    "description": "Несмотря на разнообразие, всех варваров объединяет одно — их ярость. Для каждого варвара ярость — это источник не только боевого безумия, но и невероятных рефлексов, стойкости, а также непревзойдённой силы.",
    "advice": "Во-первых, у вашей Силы должно быть наивысшее значение. Следующим по величине должно быть Телосложение.",
    "proficiency": "на 1 уровне +2, с 5 уровня +3"
  }
]
