[
  {
    "name": "Мэрьуннеры",
    "value": "Мэрьуннер",
    "description": "Тёмно - или краснокожие, невероятно крепкие, однако с худыми руками и ногами. Волосы чаще всего белые, чёрные или красные, глаза карие или голубые. Обычно мэрьуннеры крайне усердные и трудолюбивые, больше всего любят работать в большой команде. Другие расы считают, что они ограничены и не умеют выражать себя как личность. ",
    "namesExample": "Имена мэрьуннеров содержат много стыков согласных и мало мягких гласных, например: [мужские] Мортро, Наннтэн, Дордо, Варсян [женские] Гхкала, Свиврель, Остнария, Зхава",
    "advice": "Обычное распределение для расы это +2 к Силе и +1 к Харизме",
    "abilities": [
      {
        "name": "Невероятная сила",
        "description": "Для подъёма и таскания грузов вы считаетесь как Large существа"
      },
      {
        "name": "Командные игроки",
        "description": "Вы можете за бонус действие использовать действие Помощь. Существо, получившее такую помощь, может добавить d8 к той проверке d20, в которой ему помогают. Эту способность можно использовать количество раз, равное вашему бонусу мастерства; эта способность восстанавливается после короткого отдыха"
      },
      {
        "name": "Жаростойкие",
        "description": "Вы имеете сопротивление к урону огнём и делаете с преимуществом проверки, связанные с невероятной жарой"
      }
    ]
  },
  {
    "name": "Саарды",
    "value": "Саард",
    "description": "Покрыты плотным волосяным покровом, обычно чёрным. У некоторых представителей волосы могут закрывать лицо, у некоторых нет, тогда лицо вообще гладкое, виднеется их красная или светлая кожа. Имеют четыре глаза, чаще красного цвета, без зрачков. Считается, что саарды очень любопытны, но редко рвутся на рожон. Другие расы считают, что они слишком хитрые и не говорят ничего прямо, не делают ничего очевидно.",
    "namesExample": "Имена саардов обычно имеют отличительные окончания, как если бы они были транслитерированы с другого, устаревшего языка, например: [мужские] Невард, Абгард, Аристаль, Бакусталь [женские] Паруика, Сатенеика, Уранията, Октаята",
    "advice": "Обычное распределение для расы это +2 к Интеллекту и +1 к Ловкости",
    "abilities": [
      {
        "name": "Плотная шерсть",
        "description": "Если вы не носите броню, ваш класс доспеха [AC] считается как 12 + бонус ловкости"
      },
      {
        "name": "Коснувшиеся плетения",
        "description": "Вы знаете кантрип Плящущие огоньки [Dancing Lights]. Кроме того, на 3-м уровне вы получаете возможность сотворять заклинание Паутина [Web], при достижении 5-го уровня к нему добавляется заклинание Невидимость [Invisibility]. Вы можете творить эти заклинания, используя свои классовые ячейки заклинаний, либо бесплатно. После бесплатного сотворения одного из слотовых заклинаний расы, вы не можете бесплатно творить его до конца долгого отдыха. Заклинательной способностью для этих заклинаний считается Интеллект или ваша классовая заклинательная способность."
      },
      {
        "name": "Огонь внутри",
        "description": "Вы имеете сопротивление к урону холодом и делаете с преимуществом проверки, связанные с невероятным холодом"
      }
    ]
  },
  {
    "name": "Утиширы",
    "value": "Утишир",
    "description": "Коричневокожие, очень высокие и склонные к полноте. Утиширы обычно отращивают длинные, свисающие усы. Часть утиширов имеют приглушенные цвета глаз и волос (коричнево-грязный, серый, бледно-жёлтый), другие отличаются яркими волосами и глазами (пурпурно красный, кислотно зелёный, ярко жёлтый). Другие расы отличают их невероятную приспосабливаемость и выживаемость",
    "namesExample": "Имена утиширов зачастую включают в себя протяжный звук, обычно шипящий или свистящий: [мужские] Мосса, Шелай, Ишир, [женские] Уиша, Лиия, Тассара",
    "advice": "Обычное распределение для расы это +2 к Телосложению и +1 к Мудрости",
    "abilities": [
      {
        "name": "Неумирающие",
        "description": "Если вы падаете в 0 хп и атака не убивает вас мгновенно, вы можете выбрать остаться в 1 хп; сделав это, вы не можете использовать эту способность ещё раз до окончания долгого отдыха"
      },
      {
        "name": "Проверенное здоровье",
        "description": "Вы получаете +2 к максимальному хп за уровень"
      },
      {
        "name": "Выживальщики",
        "description": "Вы имеете сопротивление к урону ядом и преимущество при спас-бросках против ядов"
      }
    ]
  }
]
